---
kind: method
id: M:Autodesk.Revit.DB.FormatOptions.CanUsePlusPrefix
source: html/9f246c17-07f2-30bc-a9c0-33ad7b980662.htm
---
# Autodesk.Revit.DB.FormatOptions.CanUsePlusPrefix Method

Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.

## Syntax (C#)
```csharp
public bool CanUsePlusPrefix()
```

## Returns
True if a plus prefix can be displayed, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - UseDefault is true in this FormatOptions.